export const EXCEL_MAIN_WS_HEADERS = [
  "Наименование системы",
  "Наименование внутренних подсистем.",
  "Расположение",
  "Документация",
  "Электроплан",
  "PLC",
  "HMI",
  "ПЧ",
  "Промышленные ПК"
];

export const EXCEL_PC_WS_HEADERS = [
  "Наименование АСУ",
  "Вендер, модель ",
  "Инвентарный номер ОС ПК или комплекса",
  "Местоположение (цех\\АБК, ось\\ряд или кабинет)",
  "Назначение",
  "Имя ПК",
  "Администратор в ОС (логин/Пароль)",
  "Рабочий пользователь в ОС (логин/Пароль)",
  "Подключение к промышленной сети. (ДА\\НЕТ)  IP адрес, MAC адрес",
  "Подключение к сети предприятия (ДА\\НЕТ) IP адрес, MAC адрес",
  "Место установки. Замечания.",
  "ИБП Потребность",
  "ИБП Наличие",
  "Последняя дата Обслуживания",
  "Версия ОС",
  "Установленное промышленное ПО",
  "Администратор в  ПО (логин/Пароль)",
  "Исходник проекта ПО",
  "Ссылка на исходник проекта",
  "Резервная копия HDD, расположение"
];

export const EXCEL_PC_CONFIG_WS_HEADERS = [
  "Наименование оборудования",
  "Вендер, модель",
  "Артикул",
  "Процессор",
  "Материнская плата",
  "Сокет",
  "Тип ОЗУ",
  "Объем ОЗУ",
  "Тип HDD",
  "Объем HDD",
  "Блок питания(мощность, тип,  особенности)",
  "Установленные карты расширения",
  "Внешние устройства (тип)",
  "Вентилятор ЦП",
  "Доп.вентилятор на корпусе"
];

export const EXCEL_HMI_WS_HEADERS = [
  "Наименование подсистемы",
  "HMI",
  "Артикул",
  "Шкаф (по электроплану)",
  "Расположение шкафа (физически)",
  "Назначение",
  "Администратор (логин/Пароль)",
  "Рабочий пользователь (логин/Пароль)",
  "Интерфейс для подключения (Интерфейс, протокол, коммуникация)",
  "Настройки подключения",
  "Месторасположения кабеля",
  "Имя проекта",
  "Ссылка на проект",
  "Образ носителя",
  "Ссылка на папку с образом"
];

export const EXCEL_PLC_WS_HEADERS = [
  "Наименование подсистемы",
  "PLC",
  "Артикул",
  "Шкаф",
  "Расположение шкафа (физически)",
  "Назначение",
  "Интерфейс для подключения (Интерфейс, протокол, коммуникация)",
  "Настройки подключения",
  "Месторасположение кабеля",
  "Имя проекта",
  "Пароль PLC",
  "Пароль Safety",
  "Ссылка на проект"
];

export const EXCEL_FG_WS_HEADERS = [
  "Наименование подсистемы",
  "Наименование ПЧ",
  "Артикул",
  "Шкаф",
  "Месторасположение шкафа",
  "Назначение",
  "Интерфейс для подключения (Интерфейс, протокол, коммуникация)",
  "Настройки подключения",
  "Месторасположение кабеля",
  "Имя проекта конфигурации ПЧ (архива параметров)",
  "Ссылка"
];
